{
  "title": "In-Home-Switching",
  "author": "jakibaki, D-VAmpire",
  "category": "tool",
  "version": "0.2",
  "url": "https://github.com/jakibaki/In-Home-Switching/releases",
  "license": "GPLv3",
  "description": "Video streaming from Windows to Nintendo Switch",
  "details": "\\nThis is a homebrew that enables streaming of PC games to the Nintendo Switch!\\n\\nHave you ever been told by your parents that spending hours sitting in front of a PC was bad for you (like I was)? Well, now you can play your games portably anywhere in your house!\\n\\nThis project is fairly new, so please do not consider it totally stable. If you encounter issues, feel free to submit them.\\n\\n\\nFeatures:\\n\\n- Stream PC screen to a Nintendo Switch in your local network\\n- 720p (full Switch-Tablet display resolution)\\n- 40-60 FPS (if not see Troubleshooting)\\n- Low delay (again, see Troubleshooting)\\n- Capture controller input on Nintendo Switch\\n- Emulate an Xbox controller on the PC\\n- PC app offers picture quality adjustments\\n\\n\\nHow to Use:\\n\\nFor the PC App, you will need to execute In-Home-Switching.exe which you can download from:\\nhttps://github.com/jakibaki/In-Home-Switching/releases\\n\\nOn PC, Scp drivers must also be installed (just unzip and execute Driver Installer/ScpDriverInstaller.exe). Otherwise the program will crash silently.\\n\\nAlso please set your PC resolution to 1280x720p in Windows for getting much better performance of screen capturing while running the app.\\n\\nOn the Switch, find out its IP address (in the Internet settings) and start the app with your Switch CFW. Then type in the Switch's IP address on the PC app and hit the Connect button.\\n\\n\\nCurrent Limitations:\\n\\n- Only works with Windows 8 (64-bit) and newer\\n- No audio support atm\\n- No support for Switch CFW other than Atmosphère or Kosmos\\n\\n\\nKnown issues:\\n\\n- So far Switch crashes when put to sleep with app running (please close app beforehand, we have not fixed this issue yet)\\n- App breaks when Switch changes from docked to handheld mode or vice-versa. Please quit the app before doing so.\\n\\n\\nFurther notices:\\n\\nThis app uses core overclocking to 1785 MHz on the Nintendo Switch. We use this measure in order to decode the incoming videos efficiently. As far as we know, there have been no reported cases of this damaging any devices. In other words, it is considered safe. Still we do not warrant for any potential device damage caused by this homebrew.\\n\\n\\nTroubleshooting:\\n\\n-- Nice videos, but sadly that delay makes it unplayable --\\n\\nIf you are experiencing delays greater than 0.1 seconds, either your PC is just too slow for your chosen quality options (try worsening image quality) or your local network is bad. Basically we need instant data transfer in your network to work properly (this has nothing to do with throughput, just latency).\\nSome WiFi-routers unfortunately just aren't up to the task.\\n\\n-- These framedrops hurt my eyes! --\\n\\nYour PC is probably too slow for encoding with the games/applications on. Try other applications, lower image quality and, if you haven't already, set your PC screen resolution to 1280x720p (saves scaling).\\n\\n-- No drops, but my framerate is just very low --\\n\\nWell, in our tests we had 60 FPS on Windows 10 with low image quality... I guess you can try the same strategies as for fixing framedrops, I hope that helps.\\n\\n\\nLicense:\\n\\nThis code is licensed GPLv3 and this has a reason: We do not want to see (or read about) any parts of this project in non-open-source software (everything that is not GPLv3 licensed). Please share the notion of free code for everyone.\\n\\n\\nCredits to:\\n\\n- ffmpeg for being such a powerful media tool that we use on PC and Switch.\\n- SwitchBrew for libNX and its ffmpeg inclusion\\n- Atmosphère for being such a great Switch CFW\\n- Captura for showing us how to capture frame input with Windows Duplication API\\n- simontime for his switch-usb-screen-stream-sharp project for Windows\\n- ScpDriverInterface for the Xbox drivers on Windows",
  "changelog": "v0.2\\n\\nMassive overall performance improvements\\nAudio support\\nIP showing in-App\\nOverclocking profiles\\nConfigs on PC, thanks to SunTheCourier\\n\\n\\nInitial release\\n\\n- Video streaming from Windows to Nintendo Switch\\n- Controller input from Switch to Windows"
}